var geo=[
	[0, 0],
	[45.03447,33.9791765],//Аэропорт симфирополя
	[44.9622778,34.0839812],//ЖД Вокзал
	[44.522935,34.2535047],//Ай-даниль
	[44.4204046,34.0483715],//Алупка
	[44.677112,34.4095393],//Алушта
	[47.4625561,37.6528923],//Андреевка(Донецк) ????
	[46.113261,33.6904091],//Армянск
	[44.5121316,33.5990374],//Балаклава
	[44.7558909,33.8493068],//Бахчисарай
	[45.0584385,34.594959],//Белогорск
	[45.09739735,35.43640137],//Береговое (Феодосия)
	[44.9000419,44.9000419],//Береговое (бахчисарай)
	[0,0],//Ботанический сад ???
	[44.8435414,33.6622373],//Вилино
	[0,0],//Витино ??
	[44.4367916,34.1019841],//Гаспра
	[46.1738032,34.8068643],//Геническ (Херсон)
	[44.421136,33.9838279],//Голубой Залив
	[44.5479215,34.2736976],//Гурзуф
	[0,0],//Даниловка ??
	[45.7093755,34.3899131],//Джанкой
	[45.1907635,33.3679049],//Евпатория
	[0,0],//Заозерное ??
	[0,0],//Зеленогорье ??
	[0,0],//Золотое (Керчь) ??
	[45.2915357,33.03999961],//Казантип (Поповка)
	[44.7899492,34.8068643],//Канака
	[44.421136,34.6440901],//Кастрополь
	[44.3958034,33.9735739],//Кацивели
	[44.6270562,34.1782544],//Кача
	[45.3534002,36.4538645],//Керчь
	[45.22328175,36.4056015],//Керчь (героевка - Героевское)
	[45.3633846,36.4797974],//Керчь(порт крым)
	[44.4099486,33.9398142],//Кикенеиз
	[44.9633478,35.2381272],//Коктебель
	[44.4341131,34.0919813],//Кореиз
	[44.8612191,34.33164027],//Красные пещеры
	[45.935902,30.2948],//Курортное (Белог. р-н)
	[45.4745109,36.3411794],//Курортное (Керчь)
	[44.91029839,35.18611908],//Курортное (Коктебель р-н)
	[45.4745109,36.3411794],//Курортное (Ленин. р-н)
	[44.91443172,35.18972397],//Курортное (Щебетовка)
	[44.4427352,34.132819],//Курпаты
	[0,0],//Лавровое
	[44.6328629,34.3868605],//Лазурное
	[44.4288909,33.7070418],//Ласпи
	[45.297284,35.7758985],//Ленино
	[44.46648,34.14104],//Ливадия
	[44.7579061,34.5571009],//Малореченское
	[44.6142037,34.3627143],//Малый маяк
	[44.5087776,34.1886781],//Массандра
	[45.5876521,32.8453518],//Межводное
	[0,0],//Меллас
	[0,0],//Мирный
	[44.430451,34.0798795],//Мисхор
	[44.82417,34.8068423],//Морское (Судак)
	[45.297284,35.7758985],//Мраморные пещеры
	[0,0],//Мрия резорт СКК
	[45.4464745,35.8292505],//Мысовое(щелкино)
	[44.7263402,34.0109825],//Научный
	[45.4684299,34.73181712],//Нижнегорское
	[44.4571261,34.1419673],//Нижняя Ореанда
	[44.5158616,34.2379522],//Никита
	[44.9688031,33.6071029],//Николаевка
	[0,0],//Новоозерное
	[45.3945545,36.0633721],//Новоотрадное
	[0,0],//Новофедоровка
	[44.8291568,34.9127351],//Новый свет
	[0,0],//Окуневка
	[0,0],//Оленевка - Донецк
	[0,0],//Олива
	[44.4099486,33.9398142],//Оползневое (Мрия Резорт))
	[44.9640797,35.3580294],//Орджоникидзе
	[44.44862,33.773],//Орлиное
	[0,0],//Орловка
	[45.6070022,34.3402157],//Отрадное
	[44.4056727,33.9117275],//Парковое
	[44.58183,34.34292],//Партенит
	[45.3615941,35.9468283],//Песочное (Щелкино)
	[44.843294,33.6128756],//Песчаное
	[44.3959988,33.9523786],//Понизовка (СКК Мрия)
	[0,0],//Поповка
	[45.1453196,33.5170334],//Прибрежное (Саки)
	[45.3050417,33.1392725],//Приветное
	[45.77069005,33.49064604],//Раздольное
	[0,0],//Рыбачье
	[45.1319466,33.6001281],//Саки
	[49.6006271,34.54489965],//Саки (полтава)
	[44.4023267,33.8224464],//Санаторное
	[44.7321584,34.5007718],//Сатера
	[44.5547288,33.4720239],//Севастополь
	[0,0],//Севастополь (Любимовка)
	[44.63311587,33.55121613],//Севастополь (Север)
	[44.7171915,34.4643472],//Семидворье
	[44.4059623,34.0050679],//Симеиз
	[44.9521457,34.1024858],//Симферополь
	[44.55059,33.95599],//Соколиное
	[44.8764433,35.1010449],//Солнечная Долина
	[44.8764433,35.1010449],//Солнечногорское
	[45.0293926,35.0881549],//Старый Крым
	[44.8488369,34.971099],//Судак
	[44.8242717,33.5977538],//Угловое
	[44.59402,34.36935],//Утёс
	[44.644374,33.5407093],//Учкуевка
	[45.05008335,35.36643874],//Феодосия
	[45.04432774,35.38275719],//Феодосия (Приморский)
	[44.3915373,33.7872282],//Форос
	[0,0],//Фрунзе
	[45.489272,32.747877],//Черноморское
	[45.2657178,33.0877417],//Штормовое
	[44.9382816,35.1568474],//Щебетовка
	[45.3615941,35.9468283],//Щелкино
	[45.41291243,35.84564209],//Щелкино (Азовский)
	[44.4970713,34.1586871]//Ялта .total 0-114
];
var price=[24,16,18,34];//цена за 1 км в соответсвии с класом авто
var summury=0; //расстояние
var tarif=0; //тариф за км
var total_price=0;
window.onload=function(){
	//Текущее время компа
	var date = new Date();
	var hour=date.getHours();
	var minutes=date.getMinutes();
	var seconds=date.getSeconds();
	if(date.getHours()<10){
		hour='0'+date.getHours();
	}
	else{
		hour=date.getHours();
	}
	if(date.getMinutes()<10){
		minutes='0'+date.getMinutes();
	}
	else{
		minutes=date.getMinutes();
	}
	if(date.getSeconds()<10){
		seconds='0'+date.getSeconds();
	}
	else{
		seconds=date.getSeconds();
	}
	//Выводим текущее время компа
	var time = '<strong>'+hour+':'+minutes+':'+seconds+'</strong>';
	document.getElementById('datetimenow').innerHTML = time;
	window.setTimeout(arguments.callee, 1000);
	Obratno();
};
document.getElementById('fromair').onclick=function(){
	document.getElementById('adr_sel_from').value="1";
};
document.getElementById('fromjd').onclick=function(){
	document.getElementById('adr_sel_from').value="2";
};
document.getElementById('fromadr').onclick=function(){
	document.getElementById('adr_sel_from').value="0";
};
document.getElementById('toair').onclick=function(){
	document.getElementById('adr_sel_to').value="1";
};
document.getElementById('tojd').onclick=function(){
	document.getElementById('adr_sel_to').value="2";
};
document.getElementById('toadr').onclick=function(){
	document.getElementById('adr_sel_to').value="0";
};
document.getElementById('Obr').onchange=function(){
	Obratno();
};
document.getElementById('ZakazTaxi').onclick=function(){
	CalcTaxi();
};
//calculates distance between two points in km's
function calcDistance(p1, p2) {
  return (google.maps.geometry.spherical.computeDistanceBetween(p1, p2) / 1000).toFixed(2);
};
function Obratno(){
	if(document.getElementById('Obr').checked){
		document.getElementById('divdate2').style.display='block';
	}
	else{
		document.getElementById('divdate2').style.display='none';
	}
};
function CalcTaxi(){
	//Расчитываем расстояние м\у двумя точками
	var car=document.getElementById('car_sel_class').value;
	var from=document.getElementById('adr_sel_from').value;
	var to=document.getElementById('adr_sel_to').value;
	var pay=document.getElementById('selPay').value;
	if(from!=0&&to!=0){
		$.ajax({
			type:"POST",
	        async:true,
	        url:"./scripts/php/cors.php",
	        data:{
	        	s1:geo[from][0],
	        	d1:geo[from][1],
	        	s2:geo[to][0],
	        	d2:geo[to][1]
	        },
	        dataType:"json",
	        success:function(result){
	        	summury=0;
	        	tarif=0;
	        	tarif=price[car];
	        	summury=result['res']['route_summary']['total_distance']/1000;
	        	if(document.getElementById('Obr').checked){
	        		total_price=summury*tarif*2;
	        	}
	        	else{
	        		total_price=summury*tarif;
	        	}
	        	//Выводим расчет
	        	var question=confirm('\r\nРасстояние:'+summury+' км,\r\n Тариф '+tarif+' р. за 1 км\r\nОбщая сумма с учетом выбранного тарифа:'+total_price+' р.\r\n Хотите продолжить?');
	        	if(question==false){
	        		//Отмена заказа
	        	}
	        	else{
	        		//Оплата в зависимости от выбора способа оплаты
	        		if(pay!=0){
	        			//оплата
	        			if(pay==1){
	        				//Наличными
	        			}
	        			if(pay==2){
	        				//QIWI
	        			}
	        			if(pay==3){
	        				//Card
	        			}
	        		}
	        		else{
	        			alert('Выберите способ оплаты!');
	        		}
	        	}
	        },
	        error:function(xhr, ajaxOptions, thrownError) {
	            //console.log(xhr.status);
	            //console.log(thrownError);
	            //console.log(xhr.statusText);
	            //console.log(xhr.responseText);
	        }
	    });
	}
	else{
		var msg='Выберите ';
		if(from==0){
			msg=msg+'Откуда,';
		}
		if(to==0){
			msg=msg+' Куда';
		}
		msg=msg+' будете ехать!';
		alert(msg);
	}
}
